
{
  "scripts": {
    "start" : "node server.js"
  },

  "category": [
    {
      "title": "entertainment",
      "id": "0"
    },
    {
      "title": "sports",
      "id": "1"
    },
    {
      "title": "medical",
      "id": "2"
    },
    {
      "title": "others",
      "id": "3"
    }
  ],
  "posts": [
    {
      "authorName": "chirag",
      "title": "The Ashes: Man-of-the-match Steve Smith praises Australia's grit",
      "body": "Smith singled out spinner Nathan Lyon for his contribution to the win.\n\"Nathan Lyon was particularly good. He is going from strength to strength and bowling like a genius.\n\"He did a terrific job holding up one end. The others got the wickets.\"\nSmith almost single-handedly pulled his team out of danger with an unbeaten 141 on day three that ensured Australia could mount a charge towards victory in the second innings.\n\"Hard work at four for 70,\" he said. \"Had to dig deep and get a big total and put on a few good partnerships. We got ourselves in the lead, bowled well in the second innings, the two boys did a terrific job to get us home.\"\nEngland captain Joe Root said Smith had proved the difference and lamented his batsmen's failure to put a big score on the board.\n\"For three days we were excellent. Bar Steve's knock we were right in it,\" he said at the presentation.\n\"At 250-odd for four (we were) looking at trying to get 400 plus and put pressure on the scoreboard.\n\"In that position, having an 80-run lead would have been massive. It's frustrating. We have to move on quickly and make sure we don't make the same mistakes in Adelaide.\"",
      "category": "sports",
      "postDate": "2017-11-27",
      "id": 1
    },
    {
      "authorName": "chirag",
      "title": "India claim 5 gold medals at AIBA Youth Women Boxing Championship",
      "body": "India topped the medals' chart after claiming five gold medals on the final day of the AIBA World Women's Youth Boxing Championships on Sunday.\nNitu, Jyoti, Sakshi, Shashi Chopra and Ankushita Boro clinched the yellow metals. India earlier had also won two bronze medals. It was the biggest medal haul in the championship, followed by Russia (2 gold, 4 silver).\nIt was Nitu who began the day successfully in her light flyweight bout against Kazakh Zhazira Urakbayeva. The Indian won 5-0 as she qualified for 2018 Youth Olympics.\nUp next, flyweight boxer Jyoti unleashed a flurry of fierce punches, surprising her opponent Ekaterina Molchonova of Russia in a 5-0 triumph.\nThen, Ankushita demolished Russia's Ekaterina Dynnik in a 5-0 victory in the light welterweight final.\nIn the bantamweight final, Sakshi edged past Ivy-Jane Smith of England 3-2, while featherweight boxer Shashi floored Vietnam's Nghc Do Hong 4-1.\nThe Russian charge was led by the indestructible Anastasiia Shamonova who crushed England's Georgia O'Connor 5-0 in the middleweight category to take gold.\nKristina Tkacheva too was in a league of her own, routing Kazakhstan's Dina Isdlambekova 5-0.\nThe only American in the final, Citalli Oritz, scored a 3-2 win over Nataliya Sychugova of Russia in the welterweight final.",
      "category": "sports",
      "postDate": "2017-11-27",
      "id": 2
    },
    {
      "authorName": "chirag",
      "title": "\nfacbook\ntwitter\ngooglepluse\nYoutube\nPhillip Hughes' 3rd death anniversary: Barmy Army joins David Warner in emotional tribute",
      "body": "November 27, 2017 marks the third death anniversary of Phillip Hughes, who died three days after getting hit by a bouncer in a Sheffield Shield match between New South Wales and South Australia at the Sydney Cricket Ground in 2014.\nHughes, who was batting on 63 for South Australia in the domestic first-class match against NSW, was hit on the back of his neck by a steaming delivery from bowler Sean Abbott. The 25-year-old southpaw paused for breath with his hands on his knees before collapsing face-first onto the ground.\nThe on-field players immediately rushed to his aid while NSW cricket team's doctor John Orchard sprinted to the field. After being treated at the stadium, Hughes was rushed to hospital to have emergency surgery to relieve pressure on his brain.\nOn November 30 in 2014, Hughes would have turned 26.",
      "category": "sports",
      "postDate": "2017-11-26",
      "id": 3
    },
    {
      "authorName": "chirag",
      "title": "Kajol won't do violent revenge dramas involving kids. Here's why",
      "body": "2017 was filled with revenge dramas in Bollywood, where parents avenged the mistreatment of their children at the hands of hooligans or thugs. In Maatr, Raveena Tandon took revenge on those who murdered and raped her daughter, and Sridevi's Mom was almost the same. Bhoomi saw Sanjay Dutt beating up those who had hurt his daughter (Aditi Rao Hydari).\nWhile actors and actresses enjoy playing these roles, Kajol is just the opposite. The actress will play a mother in her next. According to a report in DNA, she said,  \"It's a nice, funny, humorous take on a mother. That's all I can say for now.\"  \nShe added,  \"As a mother, I can't see films with violence and crimes against kids. I won't be able to pull off something like that, because it shocks me and I don't want it to happen to anyone. I'm not comfortable with such roles.\"\nKajol was last seen in VIP 2, which stars Dhanush.",
      "category": "entertainment",
      "postDate": "2017-11-07",
      "id": 4
    },
    {
      "authorName": "chirag",
      "title": "Dhadak: This is what director Shashank Khaitan has to say about Janhvi Kapoor and Ishaan Khatter",
      "body": "It was only two weeks ago that producer Karan Johar introduced Janhvi Kapoor and Ishaan Khatter to the world of Bollywood with the poster of their upcoming film Dhadak. After months of waiting, Dhadak is finally on track. Directed by Shashank Khaitan, Dhadak is am official remake of 2016 Marathi film Sairat.\nWith Dhadak, Janhvi and Ishaan will be making their Bollywood debuts. And filmmaker Shashank is all praise for the star kids. \"The prep work for the film began sometime back and I have been working with them. They (Janhvi and Ishaan) are great people and are very hardworking, these are two things that I always look for in actors. They are good people who respect others and are dedicated to their work and ready to give their best,\" he told PTI.\nThe first schedule of Dhadak will go on floors in December this year, and the makers are busy getting things together.\nShashank, who directed Badrinath Ki Dulhania, said that Ishaan and Janhvi are thorough professionals, and don't come with a baggage.\n\"They (star kids) do not come with burden, they are far more relaxed and chilled out. For me, even when I was working with Varun and Alia, I was working with two new actors and they never treated me as someone from outside the film industry. And I have never treated them as someone from the industry. Same thing over here, with Janhvi and Ishaan, I am their director and they are my actors,\" added Shashank.\nDhadak is set to hit the screens on July 6, 2018.  ",
      "category": "entertainment",
      "postDate": "2017-11-22",
      "id": 5
    },
    {
      "authorName": "chirag",
      "title": "Did you know Akshay Kumar was paid Rs 5000 for his first film? Revelations made by the actor",
      "body": "He might be one of Bollywood's highest-paid actors right now, but that wasn't the case in the early 90s when he was only a struggling model. With no money to get a portfolio shoot done, Akshay Kumar decided to work with photographer Jay Seth. After innumerable auditions and modelling assignments , Akshay finally got his first break in 1991, and since then there has been no looking back for him.\nAkshay Kumar in an interview to Mid-Day spilled the beans on his initial struggle, his first pay cheque and his journey in Bollywood.\nOn being dropped from Jo Jeeta Wohi Sikander\nNot many know that Akshay had auditioned for Aamir Khan-starrer Jo Jeeta Wohi Sikander. However, it wasn't for the lead role, but for the anti-hero part. He auditioned for Deepak Tijori's part in the 1992 film, but was rejected. \"So, I went there. Apna screen test diya maine, for Deepak Tijori's role. And they didn't like it. And, apparently, I was crap, so they removed me,\" he told the daily.\nOn changing his name\nIt's been more than 25 years since Akshay Kumar has been busy casting his magic in Bollywood. If his action films earned him the title of Khiladi Kumar, his comic timing never failed to tickle the funny bone. While he has played many characters on screen, and took on new names with each film, Khiladi Kumar did that in real life too.  Born as Rajeev Bhatia, he decided to change the name before making his entry in Bollywood. And it has an interesting story behind it. Akshay (then, Rajiv Bhatia) had done a cameo in a Mahesh Bhatt film titled Aaj, but his part was snipped from the final cut. \"Kumar Gaurav was the hero in that film. He was called Akshay. And, I don't know why, it's not that I thought my name was bad. Rajiv is a very good name. Pata nahi, dimag mein koi chah aa jati hai [(something just interests you in your head). And I just wanted to go, and change my name, and I went to the court in Bandra East and did it,\" said Khiladi Kumar.",
      "category": "entertainment",
      "postDate": "2017-11-15",
      "id": 6
    },
    {
      "authorName": "chirag",
      "title": "e\nPadmavati not alone: Film industry unites in support of Bhansali's film, demands government action",
      "body": "Members from the film and entertainment industry gathered in Mumbai on Sunday to express their support and solidarity for Sanjay Leela Bhansali's controversial Padmavati. They questioned  freedom of speech and expression in India's democracy when fringe Rajput groups like the Karni Sena could constantly threaten the filmmakers and travel nationwide to stop its release.\nThe protests commenced with the National Anthem in the memory of the victims of 26/11 terrorist attack as Sunday was its 9th anniversary. Ashok Pandit of the Indian Films and TV Directors' Association (IFTDA) said, \"We, all the members of the film industry, are sensible enough to portray our history and culture in a sensible way; and it is the basic right to all the citizen of a democratic country to express thoughts freely. How could some non-constitutional bodies threaten to behead a filmmaker and cut the nose of an actress? Is this even democracy?\"\nHe urged the government to step in to control the situation and protect the right to freedom. \"Even we want to see how they could show such audacity! Such threats create questions on the livelihood of those junior artistes, carpenters, lightmen among many others who work on the set of big films like Padmavati. Therefore I would like to urge the government to step in to control the situation and protect our right to freedom.\"\nVeteran actor Pawan Malhotra, who was also present, expressed his shock at the situation. \"The way a series of incidents regarding the release of  Padmavati is happening is worrisome because we are living in a country where our freedom of expression is controlled by a group of people. They decide all the norms - what to wear, what to eat, how to celebrate a festival, what are the subject a filmmaker can film on, the list is never ending! I ask them, Why? How come they overpower the right of the CBFC to decide on a film? How come they overpower the Constitution of India to decide on our basic right to freedom?\"\nPadmavati, starring Deepika Padukone, Shahid Kapoor, and Ranveer Singh, has been in a raging storm , ever since they started shooting. Fringe groups like the Shri Rajput Karni Sena are convinced that the film is a distortion of the historic 1303 Chittorgarh siege by Turkish Alauddin Khilji, and believe that there is a romantic dream sequence between Rani Padmini (Deepika Padukone) and Khilji (Ranveer), despite Bhansali's several clarifications.\nThey've demanded a nation-wide ban of the film. The film has been banned in Rajasthan, Madhya Pradesh and Gujarat.",
      "category": "entertainment",
      "postDate": "2017-11-13",
      "id": 7
    },
    {
      "authorName": "chirag",
      "title": "High levels of natural immune suppressor in leukemia patients linked to poor survival",
      "body": "Patients diagnosed with the most common form of leukemia who also have high levels of an enzyme known to suppress the immune system are most likely to die early, researchers say.\n\nHigh levels of this enzyme, indoleamine 2,3 dioxygenase, or IDO, at diagnosis also identify those who might benefit most by taking an IDO inhibitor along with their standard therapy, they report in the Nature journal Scientific Reports.\n\n\"We want to help people who are not responding to treatment and are dying very soon after their diagnosis,\" said Dr. Ravindra Kolhe, breast and molecular pathologist and director of the Georgia Esoteric & Molecular Labs LLC in the Department of Pathology at the Medical College of Georgia at Augusta University.\n\nA review of 40 patients with acute myeloid leukemia, or AML, found increased IDO expression in the bone marrow biopsy, performed to diagnose their disease, correlated with lower overall survival rates and early mortality.\n\nIt also indicates that IDO expression should routinely be measured when the diagnostic bone marrow biopsy is performed, Kolhe says.\n\nAn early phase clinical study already is underway to begin to explore the IDO inhibitor's clinical potential in these patients. Sites include the Georgia Cancer Center at MCG as well as Johns Hopkins University and the University of Maryland Schools of Medicine, both in Baltimore. NewLinks Genetics Corp., a biopharmaceutical company based in Ames, Iowa that produces the inhibitor Indoximod, is funding the study.\n\n\"We wanted to look at what makes this leukemia so aggressive that initial induction chemotherapy is not working,\" Kolhe says. \"Early relapse tends to predict early mortality in these patients and one of the things we looked at was IDO,\" says the study's corresponding author.\n\nWhile everyone has the IDO gene, it's the cancer cells in this scenario that activate the disabler of the immune response that is also used by the fetus and solid tumors, he says.\n\nStem cells in the bone marrow are supposed to mature into a variety of cells that enable our blood and immune system function. Instead in AML, stem cells get stuck in an in-between, undifferentiated state called blasts.\n\n\"It's very normal to go to the blast step, providing it matures from there,\" Kolhe says. \"In leukemia, stem cells get limboed in the blast state so you don't get any maturation. That means there are low platelets so you get clotting problems, you have low neutrophils so you have infections, you have less red blood cells so you get anemic,\" he says.",
      "category": "medical",
      "postDate": "2017-11-21",
      "id": 8
    },
    {
      "authorName": "admin",
      "title": "Children, adolescents who do not drink tap water more likely to have tooth decay",
      "body": "American children and adolescents who do not drink tap water, which is typically fluoridated, are much more likely to have tooth decay, according to a new study in the American Journal of Preventive Medicine. However, the study confirms that those who drink tap water are more likely to have elevated levels of lead in their blood.\n\nPublic awareness of the hazards of lead-contaminated water has increased since 2014, when concerns were raised after the drinking water source for Flint, Michigan was changed to the untreated Flint River. A federal state of emergency was declared and Flint residents were instructed to use only bottled or filtered water for drinking, cooking, cleaning, and bathing.\n\nEven before the Flint water crisis, there was public mistrust of tap water safety. But avoiding fluoridated tap water raises another public health concern; children are denied its protection from tooth decay. According to the Centers for Disease Control and Prevention (CDC), adding fluoride to the water supply has dramatically reduced the prevalence of tooth decay over the past 70 years. However, tooth decay remains widespread. In 2011-2012, it affected the primary teeth of 23% of U.S. preschoolers.\n\nAnne E. Sanders, PhD, and Gary D. Slade, BDSc, PhD, of the Department of Dental Ecology, University of North Carolina at Chapel Hill, analyzed a nationally representative sample of nearly 16,000 children and adolescents aged two to 19 years who participated in the National Health and Nutrition Examination Survey (NHANES) from 2005 to 2014. More than 12,000 records included data on blood lead level and about 5,600 had dental caries examination data. NHANES is the U.S. benchmark for national surveillance of blood lead levels and is the sole national source of dental examination data.\n\nFollowing an in-home interview, participants visited a mobile examination center where they donated a blood sample, completed a dietary interview, and received a dental examination. About 15% of the children stated that they did not drink tap water. An elevated blood lead level was defined as having at least three micrograms of lead per deciliter of blood. Tooth decay was defined as the presence of one of more tooth surfaces affected by dental caries as determined by dental examiners using a standardized protocol.\n\n",
      "category": "medical",
      "postDate": "2017-11-15",
      "id": 9
    },
    {
      "authorName": "admin",
      "title": "Prisoner Post Traumatic Stress",
      "body": "Trauma is almost ubiquitous among a male prison population, with rates of exposure to violence or traumatic events being reported as anywhere between about 62% to 100% - roughly double that in a community-based male population. This includes physical assault and sexual abuse, the latter affecting almost 15-16% of male prisoners in sharp contrast to the 1-3% in the general male population.\n\nIt is established that being exposed to trauma increases the link to psychiatric illness, and most importantly PTSD. This disorder is found to affect 5% of men in general, which is in turn about 7-14% of those who have undergone significant trauma.\n\nHowever, it is noteworthy that no less than 60% of men in prison have symptoms and signs of severe to moderate PTSD, which reflects 30-60% of those who are exposed to physical trauma including assault, and 43-75% of men who were victims of sexual violence in prison.\n\nThe highest rates of PTSD occur in male prisoners who have any other mental health condition. These are horrifying statistics, especially in the light of the meager resources available to diagnose and treat this volume of male prisoners.\n\nTypes of trauma\nPrisoners are subject to various forms of trauma. Just being imprisoned is an extremely traumatic event for many prisoners, which may be responsible for precipitating PTSD following their release from detention.\n\nOther factors are interwoven into the pathogenesis of this condition, including the many risk factors that underlie the behavioral and thought patterns of many criminals. These include childhood traumas such as extreme poverty, child abuse by their parents or caregivers, experiences of neglect, physical and sexual abuse, as well as other forms of mistreatment.\n\nThese extremely painful and devastating childhood memories may often be awakened when these offenders experience prison life, with its dehumanizing, harsh and unloving environment and lifestyle.\n\nThe violence that is rampant among many prisons in close proximity to uninvolved prisoners, along with the demands of obedience to a rigid and impersonal prison discipline and the need to escape from cruel or domineering co-prisoners, as well as the urgent necessity of not being a victim of rape or violence oneself, all conspire to produce an intolerable re-enactment of childhood memories which the prisoner would gladly forget.",
      "category": "others",
      "postDate": "2017-11-06",
      "id": 10
    },
    {
      "authorName": "admin",
      "title": "Determination of Fat and Moisture using TD-NMR Snack Food Analyzers",
      "body": "The versatile, user-friendly bench-top TD-NMR analyzer from Bruker is a turn-key instrument developed for rapid Process/Quality control in the manufacture of snack foods.\n\nThe instrument obtains time-domain data in just a matter of seconds to quantitatively establish the materials’ chemical and physical properties. The signal is acquired from the hydrogen atomic nuclei contained in the samples.\n\nIt was possible to distinguish the relaxation behaviors of the NMR signal obtained from various molecules present in the sample. Moreover, the TD-NMR signal represents a clear signature of molecular mobility and therefore it also serves as an excellent phase sensor. This method looks at the basic molecular level and correlates to the samples’ macroscopic properties which make the minispec TD-NMR analyzer a robust tool for comprehensive research.\n\nThe minispec ProFiler: Take NMR to Product\nAs a single-sided NMR device, the minispec ProFiler is perfectly customized for industrial QC applications. With the help of this probe, in-situ NMR measurement of large objects can be easily performed. The minispec ProFiler can be used with swappable resonators or inserts to obtain signal from a depth of 5mm, 3mm or 0mm within the sample.",
      "category": "medical",
      "postDate": "2017-11-09",
      "id": 11
    },
    {
      "authorName": "kohli",
      "title": "Wife of Sky Sports presenter Simon Thomas dies three days after leukaemia diagnosis",
      "body": "Sports presenter Simon Thomas has revealed his wife has died three days after being diagnosed with leukaemia.\n\nThomas, who presents the Premier League coverage on Sky Sports, said his wife Gemma had visited her GP three times this week, who told her to take some pills and rest.\n\nBut when she continued to feel unwell she went to the hospital, where she was diagnosed with acute myloid leukaemia, an aggressive form of blood cancer.",
      "category": "sports",
      "postDate": "2017-11-10",
      "id": 12
    }
  ],
  "Users": [
    {
      "favourite": [],
      "userName": "guest",
      "emailId": "guest@admin.com",
      "password": "guest",
      "id": 0
    },
    {
      "favourite": [
        2,
        8,
        4
      ],
      "userName": "admin",
      "emailId": "admin@admin.com",
      "password": "admin",
      "id": 1
    },
    {
      "favourite": [
        7,
        4
      ],
      "userName": "chirag",
      "emailId": "chirag@admin.com",
      "password": "chirag",
      "id": 2
    },
    {
      "favourite": [
        11,
        4,
        10,
        7,
        6,
        9
      ],
      "userName": "kohli",
      "emailId": "kohli@kohli.com",
      "password": "kohli",
      "id": 3
    }
  ]
}
